{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "1a2eedb0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from IPython.display import display\n",
    "from collections import Counter\n",
    "import mysql.connector\n",
    "from mysql.connector import Error\n",
    "import csv\n",
    "import re\n",
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "from pandas.errors import ParserError\n",
    "\n",
    "import math\n",
    "import warnings\n",
    "warnings.filterwarnings('ignore') # setting ignore as a parameter\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "cc03eb43",
   "metadata": {},
   "outputs": [],
   "source": [
    "host = 'localhost'\n",
    "mysql_schema = 'sakila'\n",
    "mysql_user = 'root'\n",
    "mysql_password = '<put password here>'\n",
    "neo_uri=f'bolt://{host}:7687'\n",
    "neo_user='neo4j'\n",
    "neo_pass='<put password here>'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "13b20b97",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Driver has been initialized!\n"
     ]
    }
   ],
   "source": [
    "class Neo4jDB:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd=''):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "            print(\"Driver has been initialized!\")\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response\n",
    "    \n",
    "neoConn = Neo4jDB(uri=neo_uri, user=neo_user, pwd=neo_pass)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "beac3407",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to MySQL Server version  8.0.29\n",
      "You're connected to database:  ('sakila',)\n"
     ]
    }
   ],
   "source": [
    "try:\n",
    "    connection = mysql.connector.connect(host=host, database=mysql_schema, user=mysql_user, password=mysql_password)\n",
    "    \n",
    "    if connection.is_connected():\n",
    "        db_Info = connection.get_server_info()\n",
    "        print(\"Connected to MySQL Server version \", db_Info)\n",
    "        cursor = connection.cursor()\n",
    "        cursor.execute(\"select database();\")\n",
    "        record = cursor.fetchone()\n",
    "        print(\"You're connected to database: \", record)\n",
    "\n",
    "except Error as e:\n",
    "    print(\"Error while connecting to MySQL\", e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "81121343",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _clear_all(commit):\n",
    "    if commit:\n",
    "        query='''MATCH (n)\n",
    "        DETACH DELETE n\n",
    "        RETURN count(*) AS total'''\n",
    "        return neoConn.query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "896b893f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_dict(tables, keys):\n",
    "    ref = {}\n",
    "    for i in range(len(tables)):\n",
    "        table = tables[i]\n",
    "        if ref.get(table):\n",
    "            ref[table] += ','+str(keys[i])\n",
    "        else:\n",
    "            ref[table] = str(keys[i])\n",
    "    \n",
    "    return ref"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "a9380b33",
   "metadata": {},
   "outputs": [],
   "source": [
    "def populate_obj(name, df, excludes):\n",
    "    header = list(df.columns)\n",
    "    \n",
    "    obj = '('+name.lower()+':'+name.capitalize()+'{'\n",
    "    first = True\n",
    "    for h in header:\n",
    "        if h not in excludes:\n",
    "            if first:\n",
    "                first = False\n",
    "            else:\n",
    "                obj +=','\n",
    "            obj += h+': row.'+h\n",
    "        \n",
    "    obj +='})'\n",
    "    return obj"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "a6d54175",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _read_csv(table, s, e):\n",
    "    file = 'db.localhost/{}/{}.csv'.format(mysql_schema, table)\n",
    "    #print(\"file: {}\".format(file))\n",
    "    return pd.read_csv (file, sep = s, encoding = e)  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "f0b4a682",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _get_ref_node(table, ref_table):\n",
    "    #print(\"table:{}, ref_table:{}\".format(table, ref_table))\n",
    "    rtn = ref_table.lower()\n",
    "    if table and ref_table:\n",
    "        if table.strip() == ref_table.strip():\n",
    "            return \"{}_\".format(ref_table.lower())\n",
    "            \n",
    "    return rtn"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "fb047101",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_single_graph(m, df_logs, commit):\n",
    "    st = time.time()\n",
    "    table = m.get('table')    \n",
    "    print(\"\\n\\n===> Processing records for Table '{}'\".format(table))\n",
    "    if not commit:\n",
    "        print(m)    \n",
    "\n",
    "    records = _read_csv(table, ';', 'utf-8')\n",
    "\n",
    "    query = '''UNWIND $rows AS row \\nCREATE ''' + populate_obj(table.lower(), records, []) + '''\\nRETURN count(*) as total'''\n",
    "\n",
    "    df_logs = _add_row(df_logs, table, ref_tables='', no_records=len(records), no_rels=0, no_nodes=1)\n",
    "    \n",
    "    if not commit:\n",
    "        print(query)\n",
    "    else:\n",
    "        neoConn.query(query, parameters = {'rows': records.to_dict('records')})\n",
    "        \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "2c38ff17",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_joined_graph(m, s, df_logs, commit):\n",
    "    table = m.get('table')\n",
    "    print(\"\\n\\n===> Processing records for Table '{}'\".format(table))\n",
    "    if not commit:\n",
    "        print(m)    \n",
    "\n",
    "    records = _read_csv(table, ';', 'utf-8')\n",
    "\n",
    "    pri_key = m.get('pri_key').split(',')    \n",
    "    for_keys = m.get('for_keys').split(',')    \n",
    "    # print(for_keys)\n",
    "    ref_tables = m.get('ref_tables').split(',')  \n",
    "    # print(ref_tables)\n",
    "    ref_keys = m.get('ref_keys').split(',')    \n",
    "    # print(ref_keys)\n",
    "    ref = get_dict(ref_tables, ref_keys)\n",
    "    # print(ref)\n",
    "    \n",
    "    #if sorted(pri_key) == sorted(for_keys):\n",
    "    #    query = '''UNWIND $rows AS row\\nCREATE ''' + populate_obj(table.lower(), records, []) +'''\\n'''\n",
    "    #else:\n",
    "    #    query = '''UNWIND $rows AS row\\nCREATE ''' + populate_obj(table.lower(), records, for_keys) +'''\\n'''    \n",
    "    #include ids\n",
    "    query = '''UNWIND $rows AS row\\nCREATE ''' + populate_obj(table.lower(), records, []) +'''\\n'''\n",
    "    \n",
    "    start = 0\n",
    "    end = 0\n",
    "    no_edges = 0\n",
    "    for ref_table, ids in ref.items():\n",
    "        \n",
    "        ref_ids = ids.split(',')\n",
    "        # print(ref_table)\n",
    "        # print(ref_ids)\n",
    "\n",
    "        end = start+len(ref_ids)\n",
    "        fk = for_keys[start:end]\n",
    "\n",
    "        #skip, if it is a cyclic table\n",
    "        if s and ref_table in s:\n",
    "            print(\"********** Table '{}' is a cyclic referenced by Table '{}'..skipped it *********\".format(ref_table, table))\n",
    "            start = end\n",
    "            continue\n",
    "        \n",
    "        print(\"Processing reference Table '{}' ...\".format(ref_table))\n",
    "        query += '''\\nWITH distinct row, ''' + table.lower()\n",
    "        \n",
    "        no_edges += 1\n",
    "        \n",
    "        prev_fk = None\n",
    "        duplicate = False\n",
    "        uwind = {}\n",
    "        for i in range(len(fk)):\n",
    "            if (prev_fk == ref_ids[i]):\n",
    "                uwind[i] = '''\\nUNWIND row.''' + fk[i] + ''' AS _''' + fk[i]\n",
    "            else:\n",
    "                query += '''\\nUNWIND row.''' + fk[i] + ''' AS _''' + fk[i]\n",
    "            prev_fk = ref_ids[i]\n",
    "\n",
    "        if len(uwind) > 0:\n",
    "            for i in range(len(fk)):\n",
    "                if i>0:\n",
    "                    query += '''\\nWITH distinct row, ''' + table.lower()\n",
    "                    query += uwind.get(i)\n",
    "                ref = _get_ref_node(table, ref_table)\n",
    "                query += '''\\nOPTIONAL MATCH (''' +ref+ ''':'''+ ref_table.capitalize() +''' {'''\n",
    "                query += ref_ids[i] + ''': _'''+fk[i]\n",
    "                query += '''})\\nMERGE ('''+table.lower()+''')-[:'''+ table.upper() + '''_''' + ref_table.upper() +''']->('''+ref+''')'''\n",
    "        else:\n",
    "            ref = _get_ref_node(table, ref_table)\n",
    "            query += '''\\nOPTIONAL MATCH (''' + ref + ''':'''+ ref_table.capitalize() +''' {'''\n",
    "            first = True\n",
    "            for i in range(len(fk)):\n",
    "                if not first:\n",
    "                    query += ''','''\n",
    "                else:\n",
    "                    first = False\n",
    "                query += ref_ids[i] + ''': _'''+fk[i]\n",
    "            query += '''})\\nMERGE ('''+table.lower()+''')-[:'''+ table.upper() + '''_''' + ref_table.upper() +''']->('''+ref+''')'''\n",
    "\n",
    "        start = end\n",
    "\n",
    "    query += '''\\nRETURN count(*) AS total'''\n",
    "\n",
    "    df_logs = _add_row(df_logs, table, ref_tables=ref_tables, no_records=len(records), no_rels=len(ref_tables), no_nodes=1, no_edges=no_edges)\n",
    "    \n",
    "    if not commit:\n",
    "        print(query)\n",
    "    else:\n",
    "        neoConn.query(query, parameters = {'rows': records.to_dict('records')})    \n",
    "        \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "8e34aedd",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_edges(m, r, df_logs, commit):\n",
    "    table = m.get('table')\n",
    "    print(\"\\n\\n===> Creating additional Edges between Table '{}' and Table(s) '{}' \".format(table, r))\n",
    "    if not commit:\n",
    "        print(m)\n",
    "        print(r)\n",
    "\n",
    "    records = _read_csv(table, ';', 'utf-8')\n",
    "\n",
    "    pri_key = m.get('pri_key').split(',')    \n",
    "    for_keys = m.get('for_keys').split(',')    \n",
    "    # print(for_keys)\n",
    "    ref_tables = m.get('ref_tables').split(',')  \n",
    "    # print(ref_tables)\n",
    "    ref_keys = m.get('ref_keys').split(',')    \n",
    "    # print(ref_keys)\n",
    "    ref = get_dict(ref_tables, ref_keys)\n",
    "    # print(ref)\n",
    "    \n",
    "    query = '''UNWIND $rows AS row'''\n",
    "    for prim in pri_key:\n",
    "        query += '''\\nUNWIND row.''' + prim + ''' AS _''' + prim\n",
    "    \n",
    "    query += '''\\nMATCH (''' + table.lower() + ''':'''+ table.capitalize() +''' {'''\n",
    "    first = True\n",
    "    for i in range(len(pri_key)):\n",
    "        if not first:\n",
    "            query += ''','''\n",
    "        else:\n",
    "            first = False\n",
    "        query += pri_key[i] + ''': _'''+pri_key[i]\n",
    "    query += '''})'''\n",
    "\n",
    "    start = 0\n",
    "    end = 0\n",
    "    no_edges = 0\n",
    "    for ref_table, ids in ref.items():\n",
    "        \n",
    "        ref_ids = ids.split(',')\n",
    "        #print(ref_table)\n",
    "        #print(ref_ids)\n",
    "\n",
    "        end = start+len(ref_ids)\n",
    "        fk = for_keys[start:end]\n",
    "        \n",
    "        if ref_table not in r:\n",
    "            print('********** Skipping table {} **********'.format(ref_table))\n",
    "            start = end\n",
    "            continue\n",
    "                \n",
    "        print(\"Creating an Edge from Table '{}' --> Table '{}' ...\".format(table, ref_table))\n",
    "        query += '''\\nWITH distinct row, ''' + table.lower()\n",
    "        \n",
    "        no_edges += 1\n",
    "        \n",
    "        prev_fk = None\n",
    "        duplicate = False\n",
    "        uwind = {}\n",
    "        for i in range(len(fk)):\n",
    "            if (prev_fk == ref_ids[i]):\n",
    "                uwind[i] = '''\\nUNWIND row.''' + fk[i] + ''' AS _''' + fk[i]\n",
    "            else:\n",
    "                query += '''\\nUNWIND row.''' + fk[i] + ''' AS _''' + fk[i]\n",
    "            prev_fk = ref_ids[i]\n",
    "\n",
    "        if len(uwind) > 0:\n",
    "            for i in range(len(fk)):\n",
    "                if i>0:\n",
    "                    query += '''\\nWITH distinct row, ''' + table.lower()\n",
    "                    query += uwind.get(i)\n",
    "                ref = _get_ref_node(table, ref_table)\n",
    "                query += '''\\nOPTIONAL MATCH (''' + ref + ''':'''+ ref_table.capitalize() +''' {'''\n",
    "                query += ref_ids[i] + ''': _'''+fk[i]\n",
    "                query += '''})\\nMERGE ('''+table.lower()+''')-[:'''+ table.upper() + '''_''' + ref_table.upper() +''']->('''+ref+''')'''\n",
    "        else:\n",
    "            ref = _get_ref_node(table, ref_table)\n",
    "            query += '''\\nOPTIONAL MATCH (''' + ref + ''':'''+ ref_table.capitalize() +''' {'''\n",
    "            first = True\n",
    "            for i in range(len(fk)):\n",
    "                if not first:\n",
    "                    query += ''','''\n",
    "                else:\n",
    "                    first = False\n",
    "                query += ref_ids[i] + ''': _'''+fk[i]\n",
    "            query += '''})\\nMERGE ('''+table.lower()+''')-[:'''+ table.upper() + '''_''' + ref_table.upper() +''']->('''+ref+''')'''\n",
    "\n",
    "        start = end\n",
    "\n",
    "    query += '''\\nRETURN count(*) AS total'''\n",
    "\n",
    "    df_logs = _add_row(df_logs, table, ref_tables=ref_tables, no_records=len(records), no_rels=len(ref_tables), no_edges=no_edges)\n",
    "        \n",
    "    if not commit:\n",
    "        print(query)\n",
    "    else:\n",
    "        neoConn.query(query, parameters = {'rows': records.to_dict('records')})    \n",
    "        \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "e296ee90",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_ddl(c1, table):\n",
    "    q2 = \"SHOW CREATE TABLE %s;\" % table\n",
    "    c1.execute(q2)\n",
    "    result = c1.fetchone()\n",
    "    return list(result.values())[1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "68c82d10",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_metadata(c1, table):\n",
    "    ddl = get_ddl(c1, table)\n",
    "    \n",
    "    prog = re.compile('CREATE TABLE.*?`(.*).*?`\\s\\(', re.IGNORECASE)\n",
    "    table = prog.findall(ddl)[0]\n",
    "\n",
    "    prog = re.compile('PRIMARY KEY\\s\\S(.*)(?=\\))', re.IGNORECASE)\n",
    "    pri_key = prog.findall(ddl)[0].replace('`', '')\n",
    "\n",
    "    prog = re.compile('FOREIGN KEY.*?\\(`(.*).*?`\\)\\sREFERENCES', re.IGNORECASE)\n",
    "    for_keys = prog.findall(ddl)\n",
    "    for_keys = \",\".join(for_keys)\n",
    "\n",
    "    prog = re.compile('REFERENCES.*?`(.*).*?`\\s', re.IGNORECASE)\n",
    "    ref_tables = prog.findall(ddl)\n",
    "    ref_tables = \",\".join(ref_tables)\n",
    "\n",
    "    prog = re.compile('REFERENCES.*?\\(`(.*).*?`\\)', re.IGNORECASE)\n",
    "    ref_keys = prog.findall(ddl)\n",
    "    ref_keys = \",\".join(ref_keys)\n",
    "    \n",
    "    print(f'table:[{table}],pri_key:[{pri_key}],for_keys:[{for_keys}],ref_tables:[{ref_tables}],ref_keys:[{ref_keys}]')\n",
    "    \n",
    "    return {'table':table, 'pri_key':pri_key, 'for_keys': for_keys, 'ref_tables':ref_tables, 'ref_keys':ref_keys}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "bd6bc650",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _compute_out(data):\n",
    "    return len(data.split(','))        \n",
    "\n",
    "def _compute_in(key, unsorted_data):\n",
    "    counter = 0\n",
    "    for k, v in unsorted_data.items():\n",
    "        if k != key and key in v:\n",
    "            dependents = v.split(',')\n",
    "            for d in dependents:\n",
    "                if d.strip() == key:\n",
    "                    counter += 1\n",
    "    return counter\n",
    "    \n",
    "def _score_data(unsorted_data):\n",
    "    scores = {}\n",
    "    for key, data in unsorted_data.items():\n",
    "        out_elms = 0\n",
    "        in_elms = 0\n",
    "        if data.strip() == '':\n",
    "            scores[key] = 0\n",
    "        else:            \n",
    "            #compute: score = no.outgoung / no.incoming\n",
    "            out_elms = _compute_out(data)\n",
    "            in_elms = _compute_in(key, unsorted_data)\n",
    "            scores[key] = np.inf if in_elms == 0 else (out_elms/in_elms)\n",
    "        #print (\"Key [{}], Out[{}], In[{}], Score[{}]\".format(key, out_elms, in_elms, scores.get(key)))\n",
    "    \n",
    "    scores = dict(sorted(scores.items(), key=lambda item: item[1]))\n",
    "    #print(scores)\n",
    "    return scores\n",
    "    \n",
    "def _remove_best(unsorted_data, key, sorted_data, relations):\n",
    "    for k, v in unsorted_data.items():\n",
    "        if key in v:\n",
    "            deps = v.split(',')\n",
    "            dependents = deps.copy()\n",
    "            for d in deps:\n",
    "                if d.strip() == key:\n",
    "                    dependents.remove(d)\n",
    "\n",
    "                    #add the relation between this entry's key and the 'key', if record exists then append to it\n",
    "                    rels = relations.get(k)\n",
    "                    if rels:\n",
    "                        relations[k] = rels + ',' + key\n",
    "                    else:\n",
    "                        relations[k] = key\n",
    "            \n",
    "            #dependents = list(filter(lambda d: d.strip() != key, dependents))\n",
    "            unsorted_data[k] = ','.join(dependents)\n",
    "            \n",
    "    unsorted_data.pop(key, None)\n",
    "    \n",
    "def _remove_cyclic(unsorted_data, key, sorted_data, relations, cyclics):    \n",
    "    #1) add the 'key' as one of the cyclic dependencies\n",
    "    cyclics[key] = unsorted_data.get(key)\n",
    "    #2) remove from those depend on the 'key', record their relations to it, and finally remove the 'key'\n",
    "    _remove_best(unsorted_data, key, sorted_data, relations)\n",
    "    #3) finally, add the 'key' as one of the sorted keys\n",
    "    sorted_data.append(key)\n",
    "    \n",
    "def _sort(unsorted_data, sorted_data, relations, cyclics):\n",
    "    scores = _score_data(unsorted_data)\n",
    "        \n",
    "    best_key = list(scores.keys())[0]\n",
    "    best_val = list(scores.values())[0]\n",
    "    if best_val == 0:\n",
    "        #remove best[0] from unsorted_data\n",
    "        _remove_best(unsorted_data, best_key, sorted_data, relations)\n",
    "        sorted_data.append(best_key)\n",
    "    else:\n",
    "        print('CYCLIC detected!')\n",
    "        _remove_cyclic(unsorted_data, best_key, sorted_data, relations, cyclics)\n",
    "    \n",
    "    return unsorted_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "3af6f9bd",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _add_row(df_logs, table, **kwargs):\n",
    "    idx = df_logs.index[df_logs['table']==table]\n",
    "    if len(idx):\n",
    "        idx = idx[0]\n",
    "        for key, value in kwargs.items():\n",
    "            if isinstance(value, list):   \n",
    "                value = ','.join(value)\n",
    "            if key not in (['no_records', 'ref_tables']):\n",
    "                if isinstance(value, int):\n",
    "                    df_logs.at[idx, key] = value\n",
    "                else:\n",
    "                    df_logs.at[idx, key] = df_logs.iloc[idx][key] + ',' + value\n",
    "            else:\n",
    "                df_logs.at[idx, key] = value\n",
    "    else:\n",
    "        df_logs = df_logs.append({'table':table}, ignore_index=True)\n",
    "    \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "87f2140e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _populate_graph(df_logs, metas, sorted_data, relations, cyclics, commit):\n",
    "    for data in sorted_data:\n",
    "        meta = metas[data]\n",
    "        table = meta['table']\n",
    "        df_logs = _add_row(df_logs, table)\n",
    "        rels = relations.get(table)\n",
    "        skip = cyclics.get(table)\n",
    "        if rels:\n",
    "            #joined\n",
    "            df_logs = generate_joined_graph(meta, skip, df_logs, commit)\n",
    "        else:\n",
    "            #single\n",
    "            df_logs = generate_single_graph(meta, df_logs, commit)\n",
    "    \n",
    "    #create relation for cyclic references\n",
    "    for table, refs in cyclics.items():\n",
    "        meta = metas[table]\n",
    "        df_logs = generate_edges(meta, refs, df_logs, commit)\n",
    "        \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "8b1c7e4f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _print(tables, metas, sorted_data, relations, cyclics):\n",
    "    \n",
    "    df_print1 = pd.DataFrame(columns=['table', 'ref_tables'])\n",
    "    sep = '---------------'\n",
    "    for table in tables:\n",
    "        m = metas[table]\n",
    "        ref_tables = m.get('ref_tables')\n",
    "        rels = ref_tables.split(',')\n",
    "        if ref_tables == '':\n",
    "            rels = None            \n",
    "        df_print1 = df_print1.append({'table':table, 'ref_tables':rels}, ignore_index=True)    \n",
    "    df_print1 = df_print1.append({'table':sep, 'ref_tables':sep}, ignore_index=True)\n",
    "    \n",
    "    df_print2 = pd.DataFrame(columns=['table', 'ref_tables'])\n",
    "    \n",
    "    for data in sorted_data:\n",
    "        meta = metas[data]\n",
    "        table = meta['table']\n",
    "        rs = relations.get(table)\n",
    "        rels = None\n",
    "        if rs:\n",
    "            rels = rs.split(',')\n",
    "        cs = cyclics.get(table)\n",
    "        skip = None\n",
    "        if cs:\n",
    "            skip = cs.split(',')\n",
    "        if skip and rels:\n",
    "            rels = [i for i in rels if i not in skip]\n",
    "        df_print2 = df_print2.append({'table':table, 'ref_tables':rels}, ignore_index=True)\n",
    "    df_print2 = df_print2.append({'table':sep, 'ref_tables':sep}, ignore_index=True)\n",
    "        \n",
    "    df_print3 = pd.DataFrame(columns=['table', 'ref_tables'])\n",
    "    for table, refs in cyclics.items():\n",
    "        df_print3 = df_print3.append({'table':table, 'ref_tables':refs}, ignore_index=True)\n",
    "    df_print3 = df_print3.append({'table':sep, 'ref_tables':sep}, ignore_index=True)\n",
    "    \n",
    "    df_print = df_print1.append(df_print2).append(df_print3)\n",
    "    display(df_print)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "54b59139",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _generate_graph(df_logs, commit):\n",
    "    q1 = (\"SHOW TABLES FROM \" + mysql_schema)\n",
    "    c1 = connection.cursor(dictionary=True, buffered=True)\n",
    "    c1.execute(q1)\n",
    "\n",
    "    table_list = c1.fetchall()\n",
    "    tables = []\n",
    "    metas = {}\n",
    "    unsorted_data = {}\n",
    "    for entry in table_list:\n",
    "        _, table = entry.popitem()\n",
    "        tables.append(table)\n",
    "        meta = get_metadata(c1, table)\n",
    "        metas[table]=meta        \n",
    "        unsorted_data[meta.get('table')] = meta.get('ref_tables')\n",
    "    \n",
    "    sorted_data = []\n",
    "    relations = {}\n",
    "    cyclics = {}\n",
    "    half_sort = dict(sorted(unsorted_data.items(), key=lambda item: item[1]))\n",
    "    while True:\n",
    "        half_sort = _sort(half_sort, sorted_data, relations, cyclics)\n",
    "        if (len(half_sort) == 0):\n",
    "            break\n",
    "\n",
    "    _print(tables, metas, sorted_data, relations, cyclics)\n",
    "    \n",
    "    return _populate_graph(df_logs, metas, sorted_data, relations, cyclics, commit)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "c6199386",
   "metadata": {},
   "outputs": [],
   "source": [
    "def cek_graph(df_logs):\n",
    "    for table in df_logs['table']:\n",
    "        query = f'MATCH (n:{table.capitalize()}) RETURN count(n) as total'\n",
    "        total = 0\n",
    "        idx = df_logs.index[df_logs['table']==table][0]\n",
    "\n",
    "        total = neoConn.query(query)\n",
    "        df_logs.at[idx,'no_nodes'] = total[0][0]\n",
    "        \n",
    "        rt = df_logs.iloc[idx]['ref_tables']\n",
    "        if len(rt)>0:\n",
    "            ref_tables = rt.split(',')\n",
    "            ref_tables = list(dict.fromkeys(ref_tables))\n",
    "            total = 0\n",
    "            for rt in ref_tables:\n",
    "                key = f'{table}_{rt}'.upper()\n",
    "                query = f'MATCH p=()-[r:{key}]->() RETURN count(p) as total'\n",
    "                tot = neoConn.query(query)[0][0]\n",
    "                total = total + tot\n",
    "            df_logs.at[idx,'no_edges'] = total\n",
    "            \n",
    "    df_logs.loc['total']= df_logs.sum()\n",
    "    df_logs.loc[df_logs.index[-1], 'table'] = ''\n",
    "    df_logs.loc[df_logs.index[-1], 'ref_tables'] = ''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "e38b3df9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Execution time: 00:00:00\n",
      "table:[actor],pri_key:[actor_id],for_keys:[],ref_tables:[],ref_keys:[]\n",
      "table:[address],pri_key:[address_id],for_keys:[city_id],ref_tables:[city],ref_keys:[city_id]\n",
      "table:[category],pri_key:[category_id],for_keys:[],ref_tables:[],ref_keys:[]\n",
      "table:[city],pri_key:[city_id],for_keys:[country_id],ref_tables:[country],ref_keys:[country_id]\n",
      "table:[country],pri_key:[country_id],for_keys:[],ref_tables:[],ref_keys:[]\n",
      "table:[customer],pri_key:[customer_id],for_keys:[address_id,store_id],ref_tables:[address,store],ref_keys:[address_id,store_id]\n",
      "table:[film],pri_key:[film_id],for_keys:[language_id,original_language_id],ref_tables:[language,language],ref_keys:[language_id,language_id]\n",
      "table:[film_actor],pri_key:[actor_id,film_id],for_keys:[actor_id,film_id],ref_tables:[actor,film],ref_keys:[actor_id,film_id]\n",
      "table:[film_category],pri_key:[film_id,category_id],for_keys:[category_id,film_id],ref_tables:[category,film],ref_keys:[category_id,film_id]\n",
      "table:[film_text],pri_key:[film_id],for_keys:[],ref_tables:[],ref_keys:[]\n",
      "table:[inventory],pri_key:[inventory_id],for_keys:[film_id,store_id],ref_tables:[film,store],ref_keys:[film_id,store_id]\n",
      "table:[language],pri_key:[language_id],for_keys:[],ref_tables:[],ref_keys:[]\n",
      "table:[payment],pri_key:[payment_id],for_keys:[customer_id,rental_id,staff_id],ref_tables:[customer,rental,staff],ref_keys:[customer_id,rental_id,staff_id]\n",
      "table:[rental],pri_key:[rental_id],for_keys:[customer_id,inventory_id,staff_id],ref_tables:[customer,inventory,staff],ref_keys:[customer_id,inventory_id,staff_id]\n",
      "table:[staff],pri_key:[staff_id],for_keys:[address_id,store_id],ref_tables:[address,store],ref_keys:[address_id,store_id]\n",
      "table:[store],pri_key:[store_id],for_keys:[address_id,manager_staff_id],ref_tables:[address,staff],ref_keys:[address_id,staff_id]\n",
      "CYCLIC detected!\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>table</th>\n",
       "      <th>ref_tables</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>address</td>\n",
       "      <td>[city]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>category</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>city</td>\n",
       "      <td>[country]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>country</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>customer</td>\n",
       "      <td>[address, store]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>film</td>\n",
       "      <td>[language, language]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>film_actor</td>\n",
       "      <td>[actor, film]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>film_category</td>\n",
       "      <td>[category, film]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>film_text</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>inventory</td>\n",
       "      <td>[film, store]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>language</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>payment</td>\n",
       "      <td>[customer, rental, staff]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>rental</td>\n",
       "      <td>[customer, inventory, staff]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>staff</td>\n",
       "      <td>[address, store]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>store</td>\n",
       "      <td>[address, staff]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>---------------</td>\n",
       "      <td>---------------</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>actor</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>category</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>country</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>film_text</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>language</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>city</td>\n",
       "      <td>[country]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>address</td>\n",
       "      <td>[city]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>film</td>\n",
       "      <td>[language, language]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>film_actor</td>\n",
       "      <td>[actor, film]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>film_category</td>\n",
       "      <td>[category, film]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>store</td>\n",
       "      <td>[address]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>customer</td>\n",
       "      <td>[address, store]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>staff</td>\n",
       "      <td>[address, store]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>inventory</td>\n",
       "      <td>[film, store]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>rental</td>\n",
       "      <td>[customer, staff, inventory]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>payment</td>\n",
       "      <td>[customer, staff, rental]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>---------------</td>\n",
       "      <td>---------------</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>store</td>\n",
       "      <td>staff</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>---------------</td>\n",
       "      <td>---------------</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              table                    ref_tables\n",
       "0             actor                          None\n",
       "1           address                        [city]\n",
       "2          category                          None\n",
       "3              city                     [country]\n",
       "4           country                          None\n",
       "5          customer              [address, store]\n",
       "6              film          [language, language]\n",
       "7        film_actor                 [actor, film]\n",
       "8     film_category              [category, film]\n",
       "9         film_text                          None\n",
       "10        inventory                 [film, store]\n",
       "11         language                          None\n",
       "12          payment     [customer, rental, staff]\n",
       "13           rental  [customer, inventory, staff]\n",
       "14            staff              [address, store]\n",
       "15            store              [address, staff]\n",
       "16  ---------------               ---------------\n",
       "0             actor                          None\n",
       "1          category                          None\n",
       "2           country                          None\n",
       "3         film_text                          None\n",
       "4          language                          None\n",
       "5              city                     [country]\n",
       "6           address                        [city]\n",
       "7              film          [language, language]\n",
       "8        film_actor                 [actor, film]\n",
       "9     film_category              [category, film]\n",
       "10            store                     [address]\n",
       "11         customer              [address, store]\n",
       "12            staff              [address, store]\n",
       "13        inventory                 [film, store]\n",
       "14           rental  [customer, staff, inventory]\n",
       "15          payment     [customer, staff, rental]\n",
       "16  ---------------               ---------------\n",
       "0             store                         staff\n",
       "1   ---------------               ---------------"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "===> Processing records for Table 'actor'\n",
      "{'table': 'actor', 'pri_key': 'actor_id', 'for_keys': '', 'ref_tables': '', 'ref_keys': ''}\n",
      "UNWIND $rows AS row \n",
      "CREATE (actor:Actor{actor_id: row.actor_id,first_name: row.first_name,last_name: row.last_name,last_update: row.last_update})\n",
      "RETURN count(*) as total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'category'\n",
      "{'table': 'category', 'pri_key': 'category_id', 'for_keys': '', 'ref_tables': '', 'ref_keys': ''}\n",
      "UNWIND $rows AS row \n",
      "CREATE (category:Category{category_id: row.category_id,name: row.name,last_update: row.last_update})\n",
      "RETURN count(*) as total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'country'\n",
      "{'table': 'country', 'pri_key': 'country_id', 'for_keys': '', 'ref_tables': '', 'ref_keys': ''}\n",
      "UNWIND $rows AS row \n",
      "CREATE (country:Country{country_id: row.country_id,country: row.country,last_update: row.last_update})\n",
      "RETURN count(*) as total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'film_text'\n",
      "{'table': 'film_text', 'pri_key': 'film_id', 'for_keys': '', 'ref_tables': '', 'ref_keys': ''}\n",
      "UNWIND $rows AS row \n",
      "CREATE (film_text:Film_text{film_id: row.film_id,title: row.title,description: row.description})\n",
      "RETURN count(*) as total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'language'\n",
      "{'table': 'language', 'pri_key': 'language_id', 'for_keys': '', 'ref_tables': '', 'ref_keys': ''}\n",
      "UNWIND $rows AS row \n",
      "CREATE (language:Language{language_id: row.language_id,name: row.name,last_update: row.last_update})\n",
      "RETURN count(*) as total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'city'\n",
      "{'table': 'city', 'pri_key': 'city_id', 'for_keys': 'country_id', 'ref_tables': 'country', 'ref_keys': 'country_id'}\n",
      "Processing reference Table 'country' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (city:City{city_id: row.city_id,city: row.city,country_id: row.country_id,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, city\n",
      "UNWIND row.country_id AS _country_id\n",
      "OPTIONAL MATCH (country:Country {country_id: _country_id})\n",
      "MERGE (city)-[:CITY_COUNTRY]->(country)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'address'\n",
      "{'table': 'address', 'pri_key': 'address_id', 'for_keys': 'city_id', 'ref_tables': 'city', 'ref_keys': 'city_id'}\n",
      "Processing reference Table 'city' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (address:Address{address_id: row.address_id,address: row.address,address2: row.address2,district: row.district,city_id: row.city_id,postal_code: row.postal_code,phone: row.phone,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, address\n",
      "UNWIND row.city_id AS _city_id\n",
      "OPTIONAL MATCH (city:City {city_id: _city_id})\n",
      "MERGE (address)-[:ADDRESS_CITY]->(city)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'film'\n",
      "{'table': 'film', 'pri_key': 'film_id', 'for_keys': 'language_id,original_language_id', 'ref_tables': 'language,language', 'ref_keys': 'language_id,language_id'}\n",
      "Processing reference Table 'language' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (film:Film{film_id: row.film_id,title: row.title,description: row.description,release_year: row.release_year,language_id: row.language_id,original_language_id: row.original_language_id,rental_duration: row.rental_duration,rental_rate: row.rental_rate,length: row.length,replacement_cost: row.replacement_cost,rating: row.rating,special_features: row.special_features,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, film\n",
      "UNWIND row.language_id AS _language_id\n",
      "OPTIONAL MATCH (language:Language {language_id: _language_id})\n",
      "MERGE (film)-[:FILM_LANGUAGE]->(language)\n",
      "WITH distinct row, film\n",
      "UNWIND row.original_language_id AS _original_language_id\n",
      "OPTIONAL MATCH (language:Language {language_id: _original_language_id})\n",
      "MERGE (film)-[:FILM_LANGUAGE]->(language)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'film_actor'\n",
      "{'table': 'film_actor', 'pri_key': 'actor_id,film_id', 'for_keys': 'actor_id,film_id', 'ref_tables': 'actor,film', 'ref_keys': 'actor_id,film_id'}\n",
      "Processing reference Table 'actor' ...\n",
      "Processing reference Table 'film' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (film_actor:Film_actor{actor_id: row.actor_id,film_id: row.film_id,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, film_actor\n",
      "UNWIND row.actor_id AS _actor_id\n",
      "OPTIONAL MATCH (actor:Actor {actor_id: _actor_id})\n",
      "MERGE (film_actor)-[:FILM_ACTOR_ACTOR]->(actor)\n",
      "WITH distinct row, film_actor\n",
      "UNWIND row.film_id AS _film_id\n",
      "OPTIONAL MATCH (film:Film {film_id: _film_id})\n",
      "MERGE (film_actor)-[:FILM_ACTOR_FILM]->(film)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'film_category'\n",
      "{'table': 'film_category', 'pri_key': 'film_id,category_id', 'for_keys': 'category_id,film_id', 'ref_tables': 'category,film', 'ref_keys': 'category_id,film_id'}\n",
      "Processing reference Table 'category' ...\n",
      "Processing reference Table 'film' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (film_category:Film_category{film_id: row.film_id,category_id: row.category_id,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, film_category\n",
      "UNWIND row.category_id AS _category_id\n",
      "OPTIONAL MATCH (category:Category {category_id: _category_id})\n",
      "MERGE (film_category)-[:FILM_CATEGORY_CATEGORY]->(category)\n",
      "WITH distinct row, film_category\n",
      "UNWIND row.film_id AS _film_id\n",
      "OPTIONAL MATCH (film:Film {film_id: _film_id})\n",
      "MERGE (film_category)-[:FILM_CATEGORY_FILM]->(film)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'store'\n",
      "{'table': 'store', 'pri_key': 'store_id', 'for_keys': 'address_id,manager_staff_id', 'ref_tables': 'address,staff', 'ref_keys': 'address_id,staff_id'}\n",
      "Processing reference Table 'address' ...\n",
      "********** Table 'staff' is a cyclic referenced by Table 'store'..skipped it *********\n",
      "UNWIND $rows AS row\n",
      "CREATE (store:Store{store_id: row.store_id,manager_staff_id: row.manager_staff_id,address_id: row.address_id,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, store\n",
      "UNWIND row.address_id AS _address_id\n",
      "OPTIONAL MATCH (address:Address {address_id: _address_id})\n",
      "MERGE (store)-[:STORE_ADDRESS]->(address)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'customer'\n",
      "{'table': 'customer', 'pri_key': 'customer_id', 'for_keys': 'address_id,store_id', 'ref_tables': 'address,store', 'ref_keys': 'address_id,store_id'}\n",
      "Processing reference Table 'address' ...\n",
      "Processing reference Table 'store' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (customer:Customer{customer_id: row.customer_id,store_id: row.store_id,first_name: row.first_name,last_name: row.last_name,email: row.email,address_id: row.address_id,active: row.active,create_date: row.create_date,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, customer\n",
      "UNWIND row.address_id AS _address_id\n",
      "OPTIONAL MATCH (address:Address {address_id: _address_id})\n",
      "MERGE (customer)-[:CUSTOMER_ADDRESS]->(address)\n",
      "WITH distinct row, customer\n",
      "UNWIND row.store_id AS _store_id\n",
      "OPTIONAL MATCH (store:Store {store_id: _store_id})\n",
      "MERGE (customer)-[:CUSTOMER_STORE]->(store)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'staff'\n",
      "{'table': 'staff', 'pri_key': 'staff_id', 'for_keys': 'address_id,store_id', 'ref_tables': 'address,store', 'ref_keys': 'address_id,store_id'}\n",
      "Processing reference Table 'address' ...\n",
      "Processing reference Table 'store' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (staff:Staff{staff_id: row.staff_id,first_name: row.first_name,last_name: row.last_name,address_id: row.address_id,picture: row.picture,email: row.email,store_id: row.store_id,active: row.active,username: row.username,password: row.password,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, staff\n",
      "UNWIND row.address_id AS _address_id\n",
      "OPTIONAL MATCH (address:Address {address_id: _address_id})\n",
      "MERGE (staff)-[:STAFF_ADDRESS]->(address)\n",
      "WITH distinct row, staff\n",
      "UNWIND row.store_id AS _store_id\n",
      "OPTIONAL MATCH (store:Store {store_id: _store_id})\n",
      "MERGE (staff)-[:STAFF_STORE]->(store)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'inventory'\n",
      "{'table': 'inventory', 'pri_key': 'inventory_id', 'for_keys': 'film_id,store_id', 'ref_tables': 'film,store', 'ref_keys': 'film_id,store_id'}\n",
      "Processing reference Table 'film' ...\n",
      "Processing reference Table 'store' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (inventory:Inventory{inventory_id: row.inventory_id,film_id: row.film_id,store_id: row.store_id,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, inventory\n",
      "UNWIND row.film_id AS _film_id\n",
      "OPTIONAL MATCH (film:Film {film_id: _film_id})\n",
      "MERGE (inventory)-[:INVENTORY_FILM]->(film)\n",
      "WITH distinct row, inventory\n",
      "UNWIND row.store_id AS _store_id\n",
      "OPTIONAL MATCH (store:Store {store_id: _store_id})\n",
      "MERGE (inventory)-[:INVENTORY_STORE]->(store)\n",
      "RETURN count(*) AS total\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "===> Processing records for Table 'rental'\n",
      "{'table': 'rental', 'pri_key': 'rental_id', 'for_keys': 'customer_id,inventory_id,staff_id', 'ref_tables': 'customer,inventory,staff', 'ref_keys': 'customer_id,inventory_id,staff_id'}\n",
      "Processing reference Table 'customer' ...\n",
      "Processing reference Table 'inventory' ...\n",
      "Processing reference Table 'staff' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (rental:Rental{rental_id: row.rental_id,rental_date: row.rental_date,inventory_id: row.inventory_id,customer_id: row.customer_id,return_date: row.return_date,staff_id: row.staff_id,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, rental\n",
      "UNWIND row.customer_id AS _customer_id\n",
      "OPTIONAL MATCH (customer:Customer {customer_id: _customer_id})\n",
      "MERGE (rental)-[:RENTAL_CUSTOMER]->(customer)\n",
      "WITH distinct row, rental\n",
      "UNWIND row.inventory_id AS _inventory_id\n",
      "OPTIONAL MATCH (inventory:Inventory {inventory_id: _inventory_id})\n",
      "MERGE (rental)-[:RENTAL_INVENTORY]->(inventory)\n",
      "WITH distinct row, rental\n",
      "UNWIND row.staff_id AS _staff_id\n",
      "OPTIONAL MATCH (staff:Staff {staff_id: _staff_id})\n",
      "MERGE (rental)-[:RENTAL_STAFF]->(staff)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'payment'\n",
      "{'table': 'payment', 'pri_key': 'payment_id', 'for_keys': 'customer_id,rental_id,staff_id', 'ref_tables': 'customer,rental,staff', 'ref_keys': 'customer_id,rental_id,staff_id'}\n",
      "Processing reference Table 'customer' ...\n",
      "Processing reference Table 'rental' ...\n",
      "Processing reference Table 'staff' ...\n",
      "UNWIND $rows AS row\n",
      "CREATE (payment:Payment{payment_id: row.payment_id,customer_id: row.customer_id,staff_id: row.staff_id,rental_id: row.rental_id,amount: row.amount,payment_date: row.payment_date,last_update: row.last_update})\n",
      "\n",
      "WITH distinct row, payment\n",
      "UNWIND row.customer_id AS _customer_id\n",
      "OPTIONAL MATCH (customer:Customer {customer_id: _customer_id})\n",
      "MERGE (payment)-[:PAYMENT_CUSTOMER]->(customer)\n",
      "WITH distinct row, payment\n",
      "UNWIND row.rental_id AS _rental_id\n",
      "OPTIONAL MATCH (rental:Rental {rental_id: _rental_id})\n",
      "MERGE (payment)-[:PAYMENT_RENTAL]->(rental)\n",
      "WITH distinct row, payment\n",
      "UNWIND row.staff_id AS _staff_id\n",
      "OPTIONAL MATCH (staff:Staff {staff_id: _staff_id})\n",
      "MERGE (payment)-[:PAYMENT_STAFF]->(staff)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Creating additional Edges between Table 'store' and Table(s) 'staff' \n",
      "{'table': 'store', 'pri_key': 'store_id', 'for_keys': 'address_id,manager_staff_id', 'ref_tables': 'address,staff', 'ref_keys': 'address_id,staff_id'}\n",
      "staff\n",
      "********** Skipping table address **********\n",
      "Creating an Edge from Table 'store' --> Table 'staff' ...\n",
      "UNWIND $rows AS row\n",
      "UNWIND row.store_id AS _store_id\n",
      "MATCH (store:Store {store_id: _store_id})\n",
      "WITH distinct row, store\n",
      "UNWIND row.manager_staff_id AS _manager_staff_id\n",
      "OPTIONAL MATCH (staff:Staff {staff_id: _manager_staff_id})\n",
      "MERGE (store)-[:STORE_STAFF]->(staff)\n",
      "RETURN count(*) AS total\n",
      "Execution time: 00:00:02\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>table</th>\n",
       "      <th>ref_tables</th>\n",
       "      <th>no_records</th>\n",
       "      <th>no_rels</th>\n",
       "      <th>no_nodes</th>\n",
       "      <th>no_edges</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>actor</td>\n",
       "      <td></td>\n",
       "      <td>200</td>\n",
       "      <td>0</td>\n",
       "      <td>200</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>category</td>\n",
       "      <td></td>\n",
       "      <td>16</td>\n",
       "      <td>0</td>\n",
       "      <td>16</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>country</td>\n",
       "      <td></td>\n",
       "      <td>109</td>\n",
       "      <td>0</td>\n",
       "      <td>109</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>film_text</td>\n",
       "      <td></td>\n",
       "      <td>1000</td>\n",
       "      <td>0</td>\n",
       "      <td>1000</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>language</td>\n",
       "      <td></td>\n",
       "      <td>6</td>\n",
       "      <td>0</td>\n",
       "      <td>6</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>city</td>\n",
       "      <td>country</td>\n",
       "      <td>600</td>\n",
       "      <td>1</td>\n",
       "      <td>600</td>\n",
       "      <td>600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>address</td>\n",
       "      <td>city</td>\n",
       "      <td>603</td>\n",
       "      <td>1</td>\n",
       "      <td>603</td>\n",
       "      <td>603</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>film</td>\n",
       "      <td>language,language</td>\n",
       "      <td>1000</td>\n",
       "      <td>2</td>\n",
       "      <td>1000</td>\n",
       "      <td>1000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>film_actor</td>\n",
       "      <td>actor,film</td>\n",
       "      <td>5462</td>\n",
       "      <td>2</td>\n",
       "      <td>5462</td>\n",
       "      <td>10924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>film_category</td>\n",
       "      <td>category,film</td>\n",
       "      <td>1000</td>\n",
       "      <td>2</td>\n",
       "      <td>1000</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>store</td>\n",
       "      <td>address,staff</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>customer</td>\n",
       "      <td>address,store</td>\n",
       "      <td>599</td>\n",
       "      <td>2</td>\n",
       "      <td>599</td>\n",
       "      <td>1198</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>staff</td>\n",
       "      <td>address,store</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>inventory</td>\n",
       "      <td>film,store</td>\n",
       "      <td>4581</td>\n",
       "      <td>2</td>\n",
       "      <td>4581</td>\n",
       "      <td>9162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>rental</td>\n",
       "      <td>customer,inventory,staff</td>\n",
       "      <td>16044</td>\n",
       "      <td>3</td>\n",
       "      <td>16044</td>\n",
       "      <td>48132</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>payment</td>\n",
       "      <td>customer,rental,staff</td>\n",
       "      <td>16049</td>\n",
       "      <td>3</td>\n",
       "      <td>16049</td>\n",
       "      <td>48142</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>total</th>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td>47273</td>\n",
       "      <td>22</td>\n",
       "      <td>47273</td>\n",
       "      <td>121769</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               table                ref_tables no_records no_rels no_nodes  \\\n",
       "0              actor                                  200       0      200   \n",
       "1           category                                   16       0       16   \n",
       "2            country                                  109       0      109   \n",
       "3          film_text                                 1000       0     1000   \n",
       "4           language                                    6       0        6   \n",
       "5               city                   country        600       1      600   \n",
       "6            address                      city        603       1      603   \n",
       "7               film         language,language       1000       2     1000   \n",
       "8         film_actor                actor,film       5462       2     5462   \n",
       "9      film_category             category,film       1000       2     1000   \n",
       "10             store             address,staff          2       2        2   \n",
       "11          customer             address,store        599       2      599   \n",
       "12             staff             address,store          2       2        2   \n",
       "13         inventory                film,store       4581       2     4581   \n",
       "14            rental  customer,inventory,staff      16044       3    16044   \n",
       "15           payment     customer,rental,staff      16049       3    16049   \n",
       "total                                               47273      22    47273   \n",
       "\n",
       "      no_edges  \n",
       "0          NaN  \n",
       "1          NaN  \n",
       "2          NaN  \n",
       "3          NaN  \n",
       "4          NaN  \n",
       "5          600  \n",
       "6          603  \n",
       "7         1000  \n",
       "8        10924  \n",
       "9         2000  \n",
       "10           4  \n",
       "11        1198  \n",
       "12           4  \n",
       "13        9162  \n",
       "14       48132  \n",
       "15       48142  \n",
       "total   121769  "
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import time\n",
    "commit = False\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "_clear_all(commit)\n",
    "\n",
    "elapsed_time = time.time() - start_time\n",
    "print('Execution time:', time.strftime(\"%H:%M:%S\", time.gmtime(elapsed_time)))\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "_sorted = []\n",
    "\n",
    "df_logs = pd.DataFrame(columns=['table', 'ref_tables', 'no_records', 'no_rels', 'no_nodes', 'no_edges'])\n",
    "df_logs = _generate_graph(df_logs, commit)\n",
    "\n",
    "cek_graph(df_logs)\n",
    "\n",
    "elapsed_time = time.time() - start_time\n",
    "print('Execution time:', time.strftime(\"%H:%M:%S\", time.gmtime(elapsed_time)))\n",
    "df_logs"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
