{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 145,
   "id": "1a2eedb0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from collections import Counter\n",
    "import mysql.connector\n",
    "from mysql.connector import Error\n",
    "import csv\n",
    "import re\n",
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "from pandas.errors import ParserError\n",
    "\n",
    "import math\n",
    "import warnings\n",
    "warnings.filterwarnings('ignore') # setting ignore as a parameter"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "id": "13b20b97",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jDB:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd=''):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response\n",
    "    \n",
    "neoConn = Neo4jDB(uri=\"bolt://localhost:7687\", user=\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "id": "98c7c3be",
   "metadata": {},
   "outputs": [],
   "source": [
    "host = 'localhost'\n",
    "schema = 'classicmodels'\n",
    "user = 'root'\n",
    "password = '<put password here>'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "id": "beac3407",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected to MySQL Server version  8.0.29\n",
      "You're connected to database:  ('classicmodels',)\n"
     ]
    }
   ],
   "source": [
    "try:\n",
    "    connection = mysql.connector.connect(host=host, database=schema, user=user, password=password)\n",
    "    \n",
    "    if connection.is_connected():\n",
    "        db_Info = connection.get_server_info()\n",
    "        print(\"Connected to MySQL Server version \", db_Info)\n",
    "        cursor = connection.cursor()\n",
    "        cursor.execute(\"select database();\")\n",
    "        record = cursor.fetchone()\n",
    "        print(\"You're connected to database: \", record)\n",
    "\n",
    "except Error as e:\n",
    "    print(\"Error while connecting to MySQL\", e)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 149,
   "id": "81121343",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _clear_all(commit):\n",
    "    if commit:\n",
    "        query='''MATCH (n)\n",
    "        DETACH DELETE n\n",
    "        RETURN count(*) AS total'''\n",
    "        return neoConn.query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "896b893f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_dict(tables, keys):\n",
    "    ref = {}\n",
    "    for i in range(len(tables)):\n",
    "        table = tables[i]\n",
    "        if ref.get(table):\n",
    "            ref[table] += ','+str(keys[i])\n",
    "        else:\n",
    "            ref[table] = str(keys[i])\n",
    "    \n",
    "    return ref"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 151,
   "id": "a9380b33",
   "metadata": {},
   "outputs": [],
   "source": [
    "def populate_obj(name, df, excludes):\n",
    "    header = list(df.columns)\n",
    "    \n",
    "    obj = '('+name.lower()+':'+name.capitalize()+'{'\n",
    "    first = True\n",
    "    for h in header:\n",
    "        if h not in excludes:\n",
    "            if first:\n",
    "                first = False\n",
    "            else:\n",
    "                obj +=','\n",
    "            obj += h+': row.'+h\n",
    "        \n",
    "    obj +='})'\n",
    "    return obj"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 152,
   "id": "a6d54175",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _read_csv(table, s, e):\n",
    "    file = 'db.localhost/{}/{}.csv'.format(schema, table)\n",
    "    #print(\"file: {}\".format(file))\n",
    "    return pd.read_csv (file, sep = s, encoding = e)  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 153,
   "id": "f0b4a682",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _get_ref_node(table, ref_table):\n",
    "    #print(\"table:{}, ref_table:{}\".format(table, ref_table))\n",
    "    rtn = ref_table.lower()\n",
    "    if table and ref_table:\n",
    "        if table.strip() == ref_table.strip():\n",
    "            return \"{}_\".format(ref_table.lower())\n",
    "            \n",
    "    return rtn"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "id": "fb047101",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_single_graph(m, df_logs, commit):\n",
    "    st = time.time()\n",
    "    table = m.get('table')    \n",
    "    print(\"\\n\\n===> Processing records for Table '{}'\".format(table))\n",
    "    if not commit:\n",
    "        print(m)    \n",
    "\n",
    "    records = _read_csv(table, ';', 'utf-8')\n",
    "\n",
    "    query = '''UNWIND $rows AS row \\nCREATE ''' + populate_obj(table.lower(), records, []) + '''\\nRETURN count(*) as total'''\n",
    "\n",
    "    print(f'table[{table}], records[{len(records)}]')\n",
    "    df_logs = _add_row(df_logs, table, ref_tables='', no_records=len(records), no_rels=0, no_nodes=1)\n",
    "    \n",
    "    if not commit:\n",
    "        print(query)\n",
    "    else:\n",
    "        neoConn.query(query, parameters = {'rows': records.to_dict('records')})\n",
    "        \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 155,
   "id": "2c38ff17",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_joined_graph(m, s, df_logs, commit):\n",
    "    table = m.get('table')\n",
    "    print(\"\\n\\n===> Processing records for Table '{}'\".format(table))\n",
    "    if not commit:\n",
    "        print(m)    \n",
    "\n",
    "    records = _read_csv(table, ';', 'utf-8')\n",
    "\n",
    "    pri_key = m.get('pri_key').split(',')    \n",
    "    for_keys = m.get('for_keys').split(',')    \n",
    "    # print(for_keys)\n",
    "    ref_tables = m.get('ref_tables').split(',')  \n",
    "    # print(ref_tables)\n",
    "    ref_keys = m.get('ref_keys').split(',')    \n",
    "    # print(ref_keys)\n",
    "    ref = get_dict(ref_tables, ref_keys)\n",
    "    # print(ref)\n",
    "    \n",
    "    #if sorted(pri_key) == sorted(for_keys):\n",
    "    #    query = '''UNWIND $rows AS row\\nCREATE ''' + populate_obj(table.lower(), records, []) +'''\\n'''\n",
    "    #else:\n",
    "    #    query = '''UNWIND $rows AS row\\nCREATE ''' + populate_obj(table.lower(), records, for_keys) +'''\\n'''    \n",
    "    #include ids\n",
    "    query = '''UNWIND $rows AS row\\nCREATE ''' + populate_obj(table.lower(), records, []) +'''\\n'''\n",
    "    \n",
    "    start = 0\n",
    "    end = 0\n",
    "    no_edges = 0\n",
    "    for ref_table, ids in ref.items():\n",
    "        \n",
    "        ref_ids = ids.split(',')\n",
    "        # print(ref_table)\n",
    "        # print(ref_ids)\n",
    "\n",
    "        end = start+len(ref_ids)\n",
    "        fk = for_keys[start:end]\n",
    "\n",
    "        #skip, if it is a cyclic table\n",
    "        if s and ref_table in s:\n",
    "            print(\"********** Table '{}' is a cyclic referenced by Table '{}'..skipped it *********\".format(ref_table, table))\n",
    "            start = end\n",
    "            continue\n",
    "        \n",
    "        print(\"Processing reference Table '{}' ...\".format(ref_table))\n",
    "        query += '''\\nWITH distinct row, ''' + table.lower()\n",
    "        \n",
    "        no_edges += 1\n",
    "        \n",
    "        prev_fk = None\n",
    "        duplicate = False\n",
    "        uwind = {}\n",
    "        for i in range(len(fk)):\n",
    "            if (prev_fk == ref_ids[i]):\n",
    "                uwind[i] = '''\\nUNWIND row.''' + fk[i] + ''' AS _''' + fk[i]\n",
    "            else:\n",
    "                query += '''\\nUNWIND row.''' + fk[i] + ''' AS _''' + fk[i]\n",
    "            prev_fk = ref_ids[i]\n",
    "\n",
    "        if len(uwind) > 0:\n",
    "            for i in range(len(fk)):\n",
    "                if i>0:\n",
    "                    query += '''\\nWITH distinct row, ''' + table.lower()\n",
    "                    query += uwind.get(i)\n",
    "                ref = _get_ref_node(table, ref_table)\n",
    "                query += '''\\nMATCH (''' +ref+ ''':'''+ ref_table.capitalize() +''' {'''\n",
    "                query += ref_ids[i] + ''': _'''+fk[i]\n",
    "                query += '''})\\nMERGE ('''+table.lower()+''')-[:'''+ table.upper() + '''_''' + ref_table.upper() +''']->('''+ref+''')'''\n",
    "        else:\n",
    "            ref = _get_ref_node(table, ref_table)\n",
    "            query += '''\\nMATCH (''' + ref + ''':'''+ ref_table.capitalize() +''' {'''\n",
    "            first = True\n",
    "            for i in range(len(fk)):\n",
    "                if not first:\n",
    "                    query += ''','''\n",
    "                else:\n",
    "                    first = False\n",
    "                query += ref_ids[i] + ''': _'''+fk[i]\n",
    "            query += '''})\\nMERGE ('''+table.lower()+''')-[:'''+ table.upper() + '''_''' + ref_table.upper() +''']->('''+ref+''')'''\n",
    "\n",
    "        start = end\n",
    "\n",
    "    query += '''\\nRETURN count(*) AS total'''\n",
    "\n",
    "    df_logs = _add_row(df_logs, table, ref_tables=ref_tables, no_records=len(records), no_rels=len(ref_tables), no_nodes=1, no_edges=no_edges)\n",
    "    \n",
    "    if not commit:\n",
    "        print(query)\n",
    "    else:\n",
    "        neoConn.query(query, parameters = {'rows': records.to_dict('records')})    \n",
    "        \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 156,
   "id": "8e34aedd",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_edges(m, r, df_logs, commit):\n",
    "    table = m.get('table')\n",
    "    print(\"\\n\\n===> Creating additional Edges between Table '{}' and Table(s) '{}' \".format(table, r))\n",
    "    if not commit:\n",
    "        print(m)\n",
    "        print(r)\n",
    "\n",
    "    records = _read_csv(table, ';', 'utf-8')\n",
    "\n",
    "    pri_key = m.get('pri_key').split(',')    \n",
    "    for_keys = m.get('for_keys').split(',')    \n",
    "    # print(for_keys)\n",
    "    ref_tables = m.get('ref_tables').split(',')  \n",
    "    # print(ref_tables)\n",
    "    ref_keys = m.get('ref_keys').split(',')    \n",
    "    # print(ref_keys)\n",
    "    ref = get_dict(ref_tables, ref_keys)\n",
    "    # print(ref)\n",
    "    \n",
    "    query = '''UNWIND $rows AS row'''\n",
    "    for prim in pri_key:\n",
    "        query += '''\\nUNWIND row.''' + prim + ''' AS _''' + prim\n",
    "    \n",
    "    query += '''\\nMATCH (''' + table.lower() + ''':'''+ table.capitalize() +''' {'''\n",
    "    first = True\n",
    "    for i in range(len(pri_key)):\n",
    "        if not first:\n",
    "            query += ''','''\n",
    "        else:\n",
    "            first = False\n",
    "        query += pri_key[i] + ''': _'''+pri_key[i]\n",
    "    query += '''})'''\n",
    "\n",
    "    start = 0\n",
    "    end = 0\n",
    "    no_edges = 0\n",
    "    for ref_table, ids in ref.items():\n",
    "        \n",
    "        ref_ids = ids.split(',')\n",
    "        #print(ref_table)\n",
    "        #print(ref_ids)\n",
    "\n",
    "        end = start+len(ref_ids)\n",
    "        fk = for_keys[start:end]\n",
    "        \n",
    "        if ref_table not in r:\n",
    "            print('********** Skipping table {} **********'.format(ref_table))\n",
    "            start = end\n",
    "            continue\n",
    "                \n",
    "        print(\"Creating an Edge from Table '{}' --> Table '{}' ...\".format(table, ref_table))\n",
    "        query += '''\\nWITH distinct row, ''' + table.lower()\n",
    "        \n",
    "        no_edges += 1\n",
    "        \n",
    "        prev_fk = None\n",
    "        duplicate = False\n",
    "        uwind = {}\n",
    "        for i in range(len(fk)):\n",
    "            if (prev_fk == ref_ids[i]):\n",
    "                uwind[i] = '''\\nUNWIND row.''' + fk[i] + ''' AS _''' + fk[i]\n",
    "            else:\n",
    "                query += '''\\nUNWIND row.''' + fk[i] + ''' AS _''' + fk[i]\n",
    "            prev_fk = ref_ids[i]\n",
    "\n",
    "        if len(uwind) > 0:\n",
    "            for i in range(len(fk)):\n",
    "                if i>0:\n",
    "                    query += '''\\nWITH distinct row, ''' + table.lower()\n",
    "                    query += uwind.get(i)\n",
    "                ref = _get_ref_node(table, ref_table)\n",
    "                query += '''\\nMATCH (''' + ref + ''':'''+ ref_table.capitalize() +''' {'''\n",
    "                query += ref_ids[i] + ''': _'''+fk[i]\n",
    "                query += '''})\\nMERGE ('''+table.lower()+''')-[:'''+ table.upper() + '''_''' + ref_table.upper() +''']->('''+ref+''')'''\n",
    "        else:\n",
    "            ref = _get_ref_node(table, ref_table)\n",
    "            query += '''\\nMATCH (''' + ref + ''':'''+ ref_table.capitalize() +''' {'''\n",
    "            first = True\n",
    "            for i in range(len(fk)):\n",
    "                if not first:\n",
    "                    query += ''','''\n",
    "                else:\n",
    "                    first = False\n",
    "                query += ref_ids[i] + ''': _'''+fk[i]\n",
    "            query += '''})\\nMERGE ('''+table.lower()+''')-[:'''+ table.upper() + '''_''' + ref_table.upper() +''']->('''+ref+''')'''\n",
    "\n",
    "        start = end\n",
    "\n",
    "    query += '''\\nRETURN count(*) AS total'''\n",
    "\n",
    "    df_logs = _add_row(df_logs, table, ref_tables=ref_tables, no_records=len(records), no_rels=len(ref_tables), no_edges=no_edges)\n",
    "        \n",
    "    if not commit:\n",
    "        print(query)\n",
    "    else:\n",
    "        neoConn.query(query, parameters = {'rows': records.to_dict('records')})    \n",
    "        \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "id": "e296ee90",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_ddl(c1, table):\n",
    "    q2 = \"SHOW CREATE TABLE %s;\" % table\n",
    "    c1.execute(q2)\n",
    "    result = c1.fetchone()\n",
    "    return list(result.values())[1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 158,
   "id": "68c82d10",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_metadata(c1, table):\n",
    "    ddl = get_ddl(c1, table)\n",
    "    \n",
    "    prog = re.compile('CREATE TABLE.*?`(.*).*?`\\s\\(', re.IGNORECASE)\n",
    "    table = prog.findall(ddl)[0]\n",
    "\n",
    "    prog = re.compile('PRIMARY KEY\\s\\S(.*)(?=\\))', re.IGNORECASE)\n",
    "    pri_key = prog.findall(ddl)[0].replace('`', '')\n",
    "\n",
    "    prog = re.compile('FOREIGN KEY.*?\\(`(.*).*?`\\)\\sREFERENCES', re.IGNORECASE)\n",
    "    for_keys = prog.findall(ddl)\n",
    "    for_keys = \",\".join(for_keys)\n",
    "\n",
    "    prog = re.compile('REFERENCES.*?`(.*).*?`\\s', re.IGNORECASE)\n",
    "    ref_tables = prog.findall(ddl)\n",
    "    ref_tables = \",\".join(ref_tables)\n",
    "\n",
    "    prog = re.compile('REFERENCES.*?\\(`(.*).*?`\\)', re.IGNORECASE)\n",
    "    ref_keys = prog.findall(ddl)\n",
    "    ref_keys = \",\".join(ref_keys)\n",
    "    \n",
    "    return {'table':table, 'pri_key':pri_key, 'for_keys': for_keys, 'ref_tables':ref_tables, 'ref_keys':ref_keys}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 159,
   "id": "bd6bc650",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _compute_out(data):\n",
    "    return len(data.split(','))        \n",
    "\n",
    "def _compute_in(key, unsorted_data):\n",
    "    counter = 0\n",
    "    for k, v in unsorted_data.items():\n",
    "        if k != key and key in v:\n",
    "            dependents = v.split(',')\n",
    "            for d in dependents:\n",
    "                if d.strip() == key:\n",
    "                    counter += 1\n",
    "    return counter\n",
    "    \n",
    "def _score_data(unsorted_data):\n",
    "    scores = {}\n",
    "    for key, data in unsorted_data.items():\n",
    "        out_elms = 0\n",
    "        in_elms = 0\n",
    "        if data.strip() == '':\n",
    "            scores[key] = 0\n",
    "        else:            \n",
    "            #compute: score = no.outgoung / no.incoming\n",
    "            out_elms = _compute_out(data)\n",
    "            in_elms = _compute_in(key, unsorted_data)\n",
    "            scores[key] = np.inf if in_elms == 0 else (out_elms/in_elms)\n",
    "        #print (\"Key [{}], Out[{}], In[{}], Score[{}]\".format(key, out_elms, in_elms, scores.get(key)))\n",
    "    \n",
    "    scores = dict(sorted(scores.items(), key=lambda item: item[1]))\n",
    "    #print(scores)\n",
    "    return scores\n",
    "    \n",
    "def _remove_best(unsorted_data, key, sorted_data, relations):\n",
    "    for k, v in unsorted_data.items():\n",
    "        if key in v:\n",
    "            deps = v.split(',')\n",
    "            dependents = deps.copy()\n",
    "            for d in deps:\n",
    "                if d.strip() == key:\n",
    "                    dependents.remove(d)\n",
    "\n",
    "                    #add the relation between this entry's key and the 'key', if record exists then append to it\n",
    "                    rels = relations.get(k)\n",
    "                    if rels:\n",
    "                        relations[k] = rels + ',' + key\n",
    "                    else:\n",
    "                        relations[k] = key\n",
    "            \n",
    "            #dependents = list(filter(lambda d: d.strip() != key, dependents))\n",
    "            unsorted_data[k] = ','.join(dependents)\n",
    "            \n",
    "    unsorted_data.pop(key, None)\n",
    "    \n",
    "def _remove_cyclic(unsorted_data, key, sorted_data, relations, cyclics):    \n",
    "    #1) add the 'key' as one of the cyclic dependencies\n",
    "    cyclics[key] = unsorted_data.get(key)\n",
    "    #2) remove from those depend on the 'key', record their relations to it, and finally remove the 'key'\n",
    "    _remove_best(unsorted_data, key, sorted_data, relations)\n",
    "    #3) finally, add the 'key' as one of the sorted keys\n",
    "    sorted_data.append(key)\n",
    "    \n",
    "def _sort(unsorted_data, sorted_data, relations, cyclics):\n",
    "    scores = _score_data(unsorted_data)\n",
    "        \n",
    "    best_key = list(scores.keys())[0]\n",
    "    best_val = list(scores.values())[0]\n",
    "    if best_val == 0:\n",
    "        #remove best[0] from unsorted_data\n",
    "        _remove_best(unsorted_data, best_key, sorted_data, relations)\n",
    "        sorted_data.append(best_key)\n",
    "    else:\n",
    "        print('CYCLIC detected!')\n",
    "        _remove_cyclic(unsorted_data, best_key, sorted_data, relations, cyclics)\n",
    "    \n",
    "    return unsorted_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 160,
   "id": "3af6f9bd",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _add_row(df_logs, table, **kwargs):\n",
    "    idx = df_logs.index[df_logs['table']==table]\n",
    "    if len(idx):\n",
    "        idx = idx[0]\n",
    "        for key, value in kwargs.items():\n",
    "            if isinstance(value, list):   \n",
    "                value = ','.join(value)\n",
    "            if key not in (['no_records', 'ref_tables']):\n",
    "                if isinstance(value, int):\n",
    "                    df_logs.at[idx, key] = value\n",
    "                else:\n",
    "                    df_logs.at[idx, key] = df_logs.iloc[idx][key] + ',' + value\n",
    "            else:\n",
    "                df_logs.at[idx, key] = value\n",
    "    else:\n",
    "        df_logs = df_logs.append({'table':table}, ignore_index=True)\n",
    "    \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 161,
   "id": "87f2140e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _populate_graph(metas, sorted_data, relations, cyclics, df_logs, commit):\n",
    "    for data in sorted_data:\n",
    "        meta = metas[data]\n",
    "        table = meta['table']\n",
    "        df_logs = _add_row(df_logs, table)\n",
    "        rels = relations.get(table)\n",
    "        skip = cyclics.get(table)\n",
    "        if rels:\n",
    "            #joined\n",
    "            df_logs = generate_joined_graph(meta, skip, df_logs, commit)\n",
    "        else:\n",
    "            #single\n",
    "            df_logs = generate_single_graph(meta, df_logs, commit)\n",
    "    \n",
    "    #create relation for cyclic references\n",
    "    for table, refs in cyclics.items():\n",
    "        meta = metas[table]\n",
    "        df_logs = generate_edges(meta, refs, df_logs, commit)\n",
    "        \n",
    "    return df_logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 162,
   "id": "8b1c7e4f",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _print(tables, metas, sorted_data, relations, cyclics):\n",
    "    \n",
    "    df_print1 = pd.DataFrame(columns=['table', 'ref_tables'])\n",
    "    sep = '---------------'\n",
    "    for table in tables:\n",
    "        m = metas[table]\n",
    "        ref_tables = m.get('ref_tables')\n",
    "        rels = ref_tables.split(',')\n",
    "        if ref_tables == '':\n",
    "            rels = None            \n",
    "        df_print1 = df_print1.append({'table':table, 'ref_tables':rels}, ignore_index=True)    \n",
    "    df_print1 = df_print1.append({'table':sep, 'ref_tables':sep}, ignore_index=True)\n",
    "    \n",
    "    df_print2 = pd.DataFrame(columns=['table', 'ref_tables'])\n",
    "    \n",
    "    for data in sorted_data:\n",
    "        meta = metas[data]\n",
    "        table = meta['table']\n",
    "        rs = relations.get(table)\n",
    "        rels = None\n",
    "        if rs:\n",
    "            rels = rs.split(',')\n",
    "        cs = cyclics.get(table)\n",
    "        skip = None\n",
    "        if cs:\n",
    "            skip = cs.split(',')\n",
    "        if skip and rels:\n",
    "            rels = [i for i in rels if i not in skip]\n",
    "        df_print2 = df_print2.append({'table':table, 'ref_tables':rels}, ignore_index=True)\n",
    "    df_print2 = df_print2.append({'table':sep, 'ref_tables':sep}, ignore_index=True)\n",
    "        \n",
    "    df_print3 = pd.DataFrame(columns=['table', 'ref_tables'])\n",
    "    for table, refs in cyclics.items():\n",
    "        df_print3 = df_print3.append({'table':table, 'ref_tables':refs}, ignore_index=True)\n",
    "    df_print3 = df_print3.append({'table':sep, 'ref_tables':sep}, ignore_index=True)\n",
    "    \n",
    "    df_print = df_print1.append(df_print2).append(df_print3)\n",
    "    display(df_print)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 163,
   "id": "54b59139",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _generate_graph(df_logs, commit):\n",
    "    q1 = (\"SHOW TABLES FROM \" + schema)\n",
    "    c1 = connection.cursor(dictionary=True, buffered=True)\n",
    "    c1.execute(q1)\n",
    "\n",
    "    table_list = c1.fetchall()\n",
    "    tables = []\n",
    "    metas = {}\n",
    "    unsorted_data = {}\n",
    "    for entry in table_list:\n",
    "        _, table = entry.popitem()\n",
    "        tables.append(table)\n",
    "        meta = get_metadata(c1, table)\n",
    "        metas[table]=meta\n",
    "        unsorted_data[meta.get('table')] = meta.get('ref_tables')\n",
    "    \n",
    "    sorted_data = []\n",
    "    relations = {}\n",
    "    cyclics = {}\n",
    "    half_sort = dict(sorted(unsorted_data.items(), key=lambda item: item[1]))\n",
    "    while True:\n",
    "        half_sort = _sort(half_sort, sorted_data, relations, cyclics)\n",
    "        if (len(half_sort) == 0):\n",
    "            break\n",
    "\n",
    "    _print(tables, metas, sorted_data, relations, cyclics)\n",
    "    \n",
    "    return _populate_graph(metas, sorted_data, relations, cyclics, df_logs, commit)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 169,
   "id": "64db71c6",
   "metadata": {},
   "outputs": [],
   "source": [
    "def cek_graph(df_logs):\n",
    "    for table in df_logs['table']:\n",
    "        query = f'MATCH (n:{table.capitalize()}) RETURN count(n) as total'\n",
    "        total = 0\n",
    "        idx = df_logs.index[df_logs['table']==table][0]\n",
    "\n",
    "        total = neoConn.query(query)\n",
    "        df_logs.at[idx,'no_nodes'] = total[0][0]\n",
    "        \n",
    "        rt = df_logs.iloc[idx]['ref_tables']\n",
    "        if len(rt)>0:\n",
    "            ref_tables = rt.split(',')\n",
    "            ref_tables = list(dict.fromkeys(ref_tables))\n",
    "            total = 0\n",
    "            for rt in ref_tables:\n",
    "                key = f'{table}_{rt}'.upper()\n",
    "                query = f'MATCH p=()-[r:{key}]->() RETURN count(p) as total'\n",
    "                tot = neoConn.query(query)[0][0]\n",
    "                total = total + tot\n",
    "            df_logs.at[idx,'no_edges'] = total\n",
    "            \n",
    "    df_logs.loc['total']= df_logs.sum()\n",
    "    df_logs.loc[df_logs.index[-1], 'table'] = ''\n",
    "    df_logs.loc[df_logs.index[-1], 'ref_tables'] = ''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 170,
   "id": "e38b3df9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Execution time: 00:00:00\n",
      "CYCLIC detected!\n",
      "CYCLIC detected!\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>table</th>\n",
       "      <th>ref_tables</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>customers</td>\n",
       "      <td>[employees]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>employees</td>\n",
       "      <td>[employees, offices]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>offices</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>orderdetails</td>\n",
       "      <td>[orders, products]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>orders</td>\n",
       "      <td>[customers]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>payments</td>\n",
       "      <td>[customers]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>productlines</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>products</td>\n",
       "      <td>[productlines]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>---------------</td>\n",
       "      <td>---------------</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>offices</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>productlines</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>products</td>\n",
       "      <td>[productlines]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>customers</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>orders</td>\n",
       "      <td>[customers]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>payments</td>\n",
       "      <td>[customers]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>orderdetails</td>\n",
       "      <td>[products, orders]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>employees</td>\n",
       "      <td>[offices]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>---------------</td>\n",
       "      <td>---------------</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>customers</td>\n",
       "      <td>employees</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>employees</td>\n",
       "      <td>employees</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>---------------</td>\n",
       "      <td>---------------</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             table            ref_tables\n",
       "0        customers           [employees]\n",
       "1        employees  [employees, offices]\n",
       "2          offices                  None\n",
       "3     orderdetails    [orders, products]\n",
       "4           orders           [customers]\n",
       "5         payments           [customers]\n",
       "6     productlines                  None\n",
       "7         products        [productlines]\n",
       "8  ---------------       ---------------\n",
       "0          offices                  None\n",
       "1     productlines                  None\n",
       "2         products        [productlines]\n",
       "3        customers                  None\n",
       "4           orders           [customers]\n",
       "5         payments           [customers]\n",
       "6     orderdetails    [products, orders]\n",
       "7        employees             [offices]\n",
       "8  ---------------       ---------------\n",
       "0        customers             employees\n",
       "1        employees             employees\n",
       "2  ---------------       ---------------"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "===> Processing records for Table 'offices'\n",
      "{'table': 'offices', 'pri_key': 'officeCode', 'for_keys': '', 'ref_tables': '', 'ref_keys': ''}\n",
      "table[offices], records[7]\n",
      "key[ref_tables], value[]\n",
      "key[no_records], value[7]\n",
      "key[no_rels], value[0]\n",
      "key[no_nodes], value[1]\n",
      "UNWIND $rows AS row \n",
      "CREATE (offices:Offices{officeCode: row.officeCode,city: row.city,phone: row.phone,addressLine1: row.addressLine1,addressLine2: row.addressLine2,state: row.state,country: row.country,postalCode: row.postalCode,territory: row.territory})\n",
      "RETURN count(*) as total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'productlines'\n",
      "{'table': 'productlines', 'pri_key': 'productLine', 'for_keys': '', 'ref_tables': '', 'ref_keys': ''}\n",
      "table[productlines], records[7]\n",
      "key[ref_tables], value[]\n",
      "key[no_records], value[7]\n",
      "key[no_rels], value[0]\n",
      "key[no_nodes], value[1]\n",
      "UNWIND $rows AS row \n",
      "CREATE (productlines:Productlines{productLine: row.productLine,textDescription: row.textDescription,htmlDescription: row.htmlDescription,image: row.image})\n",
      "RETURN count(*) as total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'products'\n",
      "{'table': 'products', 'pri_key': 'productCode', 'for_keys': 'productLine', 'ref_tables': 'productlines', 'ref_keys': 'productLine'}\n",
      "Processing reference Table 'productlines' ...\n",
      "key[ref_tables], value[['productlines']]\n",
      "key[no_records], value[110]\n",
      "key[no_rels], value[1]\n",
      "key[no_nodes], value[1]\n",
      "key[no_edges], value[1]\n",
      "UNWIND $rows AS row\n",
      "CREATE (products:Products{productCode: row.productCode,productName: row.productName,productLine: row.productLine,productScale: row.productScale,productVendor: row.productVendor,productDescription: row.productDescription,quantityInStock: row.quantityInStock,buyPrice: row.buyPrice,MSRP: row.MSRP})\n",
      "\n",
      "WITH distinct row, products\n",
      "UNWIND row.productLine AS _productLine\n",
      "MATCH (productlines:Productlines {productLine: _productLine})\n",
      "MERGE (products)-[:PRODUCTS_PRODUCTLINES]->(productlines)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'customers'\n",
      "{'table': 'customers', 'pri_key': 'customerNumber', 'for_keys': 'salesRepEmployeeNumber', 'ref_tables': 'employees', 'ref_keys': 'employeeNumber'}\n",
      "table[customers], records[122]\n",
      "key[ref_tables], value[]\n",
      "key[no_records], value[122]\n",
      "key[no_rels], value[0]\n",
      "key[no_nodes], value[1]\n",
      "UNWIND $rows AS row \n",
      "CREATE (customers:Customers{customerNumber: row.customerNumber,customerName: row.customerName,contactLastName: row.contactLastName,contactFirstName: row.contactFirstName,phone: row.phone,addressLine1: row.addressLine1,addressLine2: row.addressLine2,city: row.city,state: row.state,postalCode: row.postalCode,country: row.country,salesRepEmployeeNumber: row.salesRepEmployeeNumber,creditLimit: row.creditLimit})\n",
      "RETURN count(*) as total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'orders'\n",
      "{'table': 'orders', 'pri_key': 'orderNumber', 'for_keys': 'customerNumber', 'ref_tables': 'customers', 'ref_keys': 'customerNumber'}\n",
      "Processing reference Table 'customers' ...\n",
      "key[ref_tables], value[['customers']]\n",
      "key[no_records], value[326]\n",
      "key[no_rels], value[1]\n",
      "key[no_nodes], value[1]\n",
      "key[no_edges], value[1]\n",
      "UNWIND $rows AS row\n",
      "CREATE (orders:Orders{orderNumber: row.orderNumber,orderDate: row.orderDate,requiredDate: row.requiredDate,shippedDate: row.shippedDate,status: row.status,comments: row.comments,customerNumber: row.customerNumber})\n",
      "\n",
      "WITH distinct row, orders\n",
      "UNWIND row.customerNumber AS _customerNumber\n",
      "MATCH (customers:Customers {customerNumber: _customerNumber})\n",
      "MERGE (orders)-[:ORDERS_CUSTOMERS]->(customers)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'payments'\n",
      "{'table': 'payments', 'pri_key': 'customerNumber,checkNumber', 'for_keys': 'customerNumber', 'ref_tables': 'customers', 'ref_keys': 'customerNumber'}\n",
      "Processing reference Table 'customers' ...\n",
      "key[ref_tables], value[['customers']]\n",
      "key[no_records], value[273]\n",
      "key[no_rels], value[1]\n",
      "key[no_nodes], value[1]\n",
      "key[no_edges], value[1]\n",
      "UNWIND $rows AS row\n",
      "CREATE (payments:Payments{customerNumber: row.customerNumber,checkNumber: row.checkNumber,paymentDate: row.paymentDate,amount: row.amount})\n",
      "\n",
      "WITH distinct row, payments\n",
      "UNWIND row.customerNumber AS _customerNumber\n",
      "MATCH (customers:Customers {customerNumber: _customerNumber})\n",
      "MERGE (payments)-[:PAYMENTS_CUSTOMERS]->(customers)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'orderdetails'\n",
      "{'table': 'orderdetails', 'pri_key': 'orderNumber,productCode', 'for_keys': 'orderNumber,productCode', 'ref_tables': 'orders,products', 'ref_keys': 'orderNumber,productCode'}\n",
      "Processing reference Table 'orders' ...\n",
      "Processing reference Table 'products' ...\n",
      "key[ref_tables], value[['orders', 'products']]\n",
      "key[no_records], value[2996]\n",
      "key[no_rels], value[2]\n",
      "key[no_nodes], value[1]\n",
      "key[no_edges], value[2]\n",
      "UNWIND $rows AS row\n",
      "CREATE (orderdetails:Orderdetails{orderNumber: row.orderNumber,productCode: row.productCode,quantityOrdered: row.quantityOrdered,priceEach: row.priceEach,orderLineNumber: row.orderLineNumber})\n",
      "\n",
      "WITH distinct row, orderdetails\n",
      "UNWIND row.orderNumber AS _orderNumber\n",
      "MATCH (orders:Orders {orderNumber: _orderNumber})\n",
      "MERGE (orderdetails)-[:ORDERDETAILS_ORDERS]->(orders)\n",
      "WITH distinct row, orderdetails\n",
      "UNWIND row.productCode AS _productCode\n",
      "MATCH (products:Products {productCode: _productCode})\n",
      "MERGE (orderdetails)-[:ORDERDETAILS_PRODUCTS]->(products)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Processing records for Table 'employees'\n",
      "{'table': 'employees', 'pri_key': 'employeeNumber', 'for_keys': 'reportsTo,officeCode', 'ref_tables': 'employees,offices', 'ref_keys': 'employeeNumber,officeCode'}\n",
      "********** Table 'employees' is a cyclic referenced by Table 'employees'..skipped it *********\n",
      "Processing reference Table 'offices' ...\n",
      "key[ref_tables], value[['employees', 'offices']]\n",
      "key[no_records], value[23]\n",
      "key[no_rels], value[2]\n",
      "key[no_nodes], value[1]\n",
      "key[no_edges], value[1]\n",
      "UNWIND $rows AS row\n",
      "CREATE (employees:Employees{employeeNumber: row.employeeNumber,lastName: row.lastName,firstName: row.firstName,extension: row.extension,email: row.email,officeCode: row.officeCode,reportsTo: row.reportsTo,jobTitle: row.jobTitle})\n",
      "\n",
      "WITH distinct row, employees\n",
      "UNWIND row.officeCode AS _officeCode\n",
      "MATCH (offices:Offices {officeCode: _officeCode})\n",
      "MERGE (employees)-[:EMPLOYEES_OFFICES]->(offices)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Creating additional Edges between Table 'customers' and Table(s) 'employees' \n",
      "{'table': 'customers', 'pri_key': 'customerNumber', 'for_keys': 'salesRepEmployeeNumber', 'ref_tables': 'employees', 'ref_keys': 'employeeNumber'}\n",
      "employees\n",
      "Creating an Edge from Table 'customers' --> Table 'employees' ...\n",
      "key[ref_tables], value[['employees']]\n",
      "key[no_records], value[122]\n",
      "key[no_rels], value[1]\n",
      "key[no_edges], value[1]\n",
      "UNWIND $rows AS row\n",
      "UNWIND row.customerNumber AS _customerNumber\n",
      "MATCH (customers:Customers {customerNumber: _customerNumber})\n",
      "WITH distinct row, customers\n",
      "UNWIND row.salesRepEmployeeNumber AS _salesRepEmployeeNumber\n",
      "MATCH (employees:Employees {employeeNumber: _salesRepEmployeeNumber})\n",
      "MERGE (customers)-[:CUSTOMERS_EMPLOYEES]->(employees)\n",
      "RETURN count(*) AS total\n",
      "\n",
      "\n",
      "===> Creating additional Edges between Table 'employees' and Table(s) 'employees' \n",
      "{'table': 'employees', 'pri_key': 'employeeNumber', 'for_keys': 'reportsTo,officeCode', 'ref_tables': 'employees,offices', 'ref_keys': 'employeeNumber,officeCode'}\n",
      "employees\n",
      "Creating an Edge from Table 'employees' --> Table 'employees' ...\n",
      "********** Skipping table offices **********\n",
      "key[ref_tables], value[['employees', 'offices']]\n",
      "key[no_records], value[23]\n",
      "key[no_rels], value[2]\n",
      "key[no_edges], value[1]\n",
      "UNWIND $rows AS row\n",
      "UNWIND row.employeeNumber AS _employeeNumber\n",
      "MATCH (employees:Employees {employeeNumber: _employeeNumber})\n",
      "WITH distinct row, employees\n",
      "UNWIND row.reportsTo AS _reportsTo\n",
      "MATCH (employees_:Employees {employeeNumber: _reportsTo})\n",
      "MERGE (employees)-[:EMPLOYEES_EMPLOYEES]->(employees_)\n",
      "RETURN count(*) AS total\n",
      "Execution time: 00:00:00\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>table</th>\n",
       "      <th>ref_tables</th>\n",
       "      <th>no_records</th>\n",
       "      <th>no_rels</th>\n",
       "      <th>no_nodes</th>\n",
       "      <th>no_edges</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>offices</td>\n",
       "      <td></td>\n",
       "      <td>7</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>productlines</td>\n",
       "      <td></td>\n",
       "      <td>7</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>products</td>\n",
       "      <td>productlines</td>\n",
       "      <td>110</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>customers</td>\n",
       "      <td>employees</td>\n",
       "      <td>122</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>orders</td>\n",
       "      <td>customers</td>\n",
       "      <td>326</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>payments</td>\n",
       "      <td>customers</td>\n",
       "      <td>273</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>orderdetails</td>\n",
       "      <td>orders,products</td>\n",
       "      <td>2996</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>employees</td>\n",
       "      <td>employees,offices</td>\n",
       "      <td>23</td>\n",
       "      <td>2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>total</th>\n",
       "      <td></td>\n",
       "      <td></td>\n",
       "      <td>3864</td>\n",
       "      <td>8</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              table         ref_tables no_records no_rels no_nodes no_edges\n",
       "0           offices                             7       0        0      NaN\n",
       "1      productlines                             7       0        0      NaN\n",
       "2          products       productlines        110       1        0        0\n",
       "3         customers          employees        122       1        0        0\n",
       "4            orders          customers        326       1        0        0\n",
       "5          payments          customers        273       1        0        0\n",
       "6      orderdetails    orders,products       2996       2        0        0\n",
       "7         employees  employees,offices         23       2        0        0\n",
       "total                                        3864       8        0        0"
      ]
     },
     "execution_count": 170,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import time\n",
    "commit = False\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "_clear_all(commit)\n",
    "\n",
    "elapsed_time = time.time() - start_time\n",
    "print('Execution time:', time.strftime(\"%H:%M:%S\", time.gmtime(elapsed_time)))\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "_sorted = []\n",
    "\n",
    "df_logs = pd.DataFrame(columns=['table', 'ref_tables', 'no_records', 'no_rels', 'no_nodes', 'no_edges'])\n",
    "df_logs = _generate_graph(df_logs, commit)\n",
    "\n",
    "cek_graph(df_logs)\n",
    "\n",
    "elapsed_time = time.time() - start_time\n",
    "print('Execution time:', time.strftime(\"%H:%M:%S\", time.gmtime(elapsed_time)))\n",
    "df_logs"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
